# Erase Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PanelTypeSet..::..Erase Method
PanelTypeSet Class See Also
---
Removes a specified panel type from the set.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual int Erase(
	PanelType item
)
```

Visual Basic
---
```text
Public Overridable Function Erase ( _
	item As PanelType _
) As Integer
```

Visual C++
---
```text
public:
virtual int Erase(
	PanelType^ item
)
```

# ### Parameters
item
    Type: Autodesk.Revit.DB..::..PanelTypeThe panel type to be erased.
# ### Return Value
The number of panel types that were erased from the set.
# See Also
PanelTypeSet Class
Autodesk.Revit.DB Namespace